# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'brave-browser'
cask 'caffeine'
cask 'cyberduck'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'fork'
cask 'github'
cask 'google-chrome'
cask 'handbrake'
cask 'imageoptim'
cask 'insomnia'
cask 'plexamp'
cask 'steam'
cask 'sequel-pro'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'there'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'Unsplash Wallpapers', id: 1284863847
mas 'GoodNotes 5', id: 1444383602
mas 'MacFamilyTree 9', id: 1458866808
mas 'Pixelmator Pro', id: 1289583905
mas 'Day One', id: 1055511498
mas 'Deliveries 3', id: 924726344
mas 'Final Cut Pro', id: 424389933
mas 'Compressor', id: 424390742
